package lesson1;


public class task1 {
    public static void main(String[] args) {
        // объявляю переменную
        String msg = "Hello" + " " + "Bob!";
        // вывожу строку в консоль
        System.out.println(msg);
    }
}

// Скомпилируйте данный класс и далее выполните декомпиляцию для созданного во время компиляции "task1.class" файла.
// Попробуйте объяснить, почему содержимое java и class файла разное ?

// Ответ : отсутствуют комменты, появился пустой конструктор, оптимизированна запись значения в переменную msg